; domain
(define (domain spanner)                    
(:requirements :typing :strips :constraints)      

(:types 
	location locatable - object
	man nut spanner - locatable	
)                                           
                                                                               
(:predicates 
	(at ?m - locatable ?l - location)
	(carrying ?m - man ?s - spanner)
	(useable ?s - spanner)
	(link ?l1 - location ?l2 - location)
	(tightened ?n - nut)
	(loose ?n - nut))                                                                                           
(:action walk 
        :parameters (?start - location ?end - location ?m - man)
        :precondition (and (at ?m ?start) 
                           (link ?start ?end))                                                          
        :effect (and (not (at ?m ?start)) (at ?m ?end)))

(:action pickup_spanner 
        :parameters (?l - location ?s - spanner ?m - man)
        :precondition (and (at ?m ?l) 
                           (at ?s ?l))
        :effect (and (not (at ?s ?l))
                     (carrying ?m ?s)))

(:action tighten_nut 
        :parameters (?l - location ?s - spanner ?m - man ?n - nut)
        :precondition (and (at ?m ?l) 
		      	   (at ?n ?l)
			   (carrying ?m ?s)
			   (useable ?s)
			   (loose ?n))
        :effect (and (not (loose ?n))(not (useable ?s)) (tightened ?n)))
)

; problem
; params: python3 spanner-generator.py 5 4 8 --seed 889588 --problem-name prob_s5_n4_l8_s889588
(define (problem prob_s5_n4_l8_s889588)
 (:domain spanner)
 (:objects 
     bob - man
     spanner1 spanner2 spanner3 spanner4 spanner5 - spanner
     nut1 nut2 nut3 nut4 - nut
     location1 location2 location3 location4 location5 location6 location7 location8 - location
     shed gate - location
    )
 (:init 
    (at bob shed)
    (at spanner1 location8)
    (useable spanner1)
    (at spanner2 location8)
    (useable spanner2)
    (at spanner3 location4)
    (useable spanner3)
    (at spanner4 location4)
    (useable spanner4)
    (at spanner5 location7)
    (useable spanner5)
    (loose nut1)
    (at nut1 gate)
    (loose nut2)
    (at nut2 gate)
    (loose nut3)
    (at nut3 gate)
    (loose nut4)
    (at nut4 gate)
    (link shed location1)
    (link location8 gate)
    (link location1 location2)
    (link location2 location3)
    (link location3 location4)
    (link location4 location5)
    (link location5 location6)
    (link location6 location7)
    (link location7 location8)
)
 (:goal
  (and
   (tightened nut1)
   (tightened nut2)
   (tightened nut3)
   (tightened nut4)
)))

; plan
1. (walk shed location1 bob)
   deleted: (at bob shed)
   added: (at bob location1)
   goals met: 0 of 4
2. (walk location1 location2 bob)
   deleted: (at bob location1)
   added: (at bob location2)
   goals met: 0 of 4
3. (walk location2 location3 bob)
   deleted: (at bob location2)
   added: (at bob location3)
   goals met: 0 of 4
4. (walk location3 location4 bob)
   deleted: (at bob location3)
   added: (at bob location4)
   goals met: 0 of 4
5. (pickup_spanner location4 spanner3 bob)
   deleted: (at spanner3 location4)
   added: (carrying bob spanner3)
   goals met: 0 of 4
6. (walk location4 location5 bob)
   deleted: (at bob location4)
   added: (at bob location5)
   goals met: 0 of 4
7. (walk location5 location6 bob)
   deleted: (at bob location5)
   added: (at bob location6)
   goals met: 0 of 4
8. (walk location6 location7 bob)
   deleted: (at bob location6)
   added: (at bob location7)
   goals met: 0 of 4
9. (pickup_spanner location7 spanner5 bob)
   deleted: (at spanner5 location7)
   added: (carrying bob spanner5)
   goals met: 0 of 4
10. (walk location7 location8 bob)
   deleted: (at bob location7)
   added: (at bob location8)
   goals met: 0 of 4
11. (pickup_spanner location8 spanner1 bob)
   deleted: (at spanner1 location8)
   added: (carrying bob spanner1)
   goals met: 0 of 4
12. (pickup_spanner location8 spanner2 bob)
   deleted: (at spanner2 location8)
   added: (carrying bob spanner2)
   goals met: 0 of 4
13. (walk location8 gate bob)
   deleted: (at bob location8)
   added: (at bob gate)
   goals met: 0 of 4
14. (tighten_nut gate spanner1 bob nut4)
   deleted: (loose nut4) (useable spanner1)
   added: (tightened nut4)
   goals met: 1 of 4
15. (tighten_nut gate spanner2 bob nut3)
   deleted: (loose nut3) (useable spanner2)
   added: (tightened nut3)
   goals met: 2 of 4
16. (tighten_nut gate spanner3 bob nut2)
   deleted: (loose nut2) (useable spanner3)
   added: (tightened nut2)
   goals met: 3 of 4
17. (tighten_nut gate spanner5 bob nut1)
   deleted: (loose nut1) (useable spanner5)
   added: (tightened nut1)
   goals met: 4 of 4
